/*
0.1 自测-1 打印沙漏 （20 分）
本题要求你写个程序把给定的符号打印成沙漏的形状。例如给定17个“*”，要求按下列格式打印
*****
 ***
  *
 ***
*****
所谓“沙漏形状”，是指每行输出奇数个符号；各行符号中心对齐；相邻两行符号数差2；
符号数先从大到小顺序递减到1，再从小到大顺序递增；首尾符号数相等。
给定任意N个符号，不一定能正好组成一个沙漏。要求打印出的沙漏能用掉尽可能多的符号。

输入格式:
输入在一行给出1个正整数N（≤1000）和一个符号，中间以空格分隔。

输出格式:
首先打印出由给定符号组成的最大的沙漏形状，最后在一行中输出剩下没用掉的符号数。

输入样例:
19 *
输出样例:
*****
 ***
  *
 ***
*****
2


*/ 
/*
a[n] = 4 * n - 2。 
n	a[n]	s[n] 
1  2        1
2  6        7
3  10       17
4  14  		31
5  18		49
6  22		71
*/

#include <stdio.h>

int main()
{
	int num;
  	char c;
  	// 空格隔着 %d、%c,便于字符读取,这里没有空格,读输入时会误读数字后空的空格。 
 	scanf("%d %c", &num, &c);
  
  	int i, j, n, rem;
  	int sum = 1;	

  	// num在 1 - 7 内。 
  	if (num < 7)
  	{
		printf("%c\n", c);
		
		rem = --num;
  	}
  	else
  	{
  		// 计算层数和余下符号数。 
		for (i = 2; i < 23; i++)
   		{
      		sum = 4 * i - 2 + sum;
      	
		  	if ((num - sum) < 4 * i + 2)
      		{
	        	rem = num - sum;
       	 		n = i;
    		    break;
      		}
    	}	
		
		// 输出 n - 1 层。 
		for (i = n; i > 0; i--)
		{
			for ( j = n; j > i; j--)
			{
				printf(" ");
			}
			
			for (j = 0; j < (4 * i - 2) / 2; j++)
			{
				printf("%c", c);	
			}	
			
			printf("\n");
		} 
		
		// 输出 -2 - -n 层。 
		for (i = 2; i <= n; i++)
		{
			for ( j = i; j < n; j++)
			{
				printf(" ");
			}
			
			for (j = 0; j < (4 * i - 2) / 2; j++)
			{
				printf("%c", c);	
			}	
			
			printf("\n");
		} 
	}  
	
	printf("%d", rem);
	
	return 0;
}
